garyStofer/MSP430_CCS_CC2500_prj/SimpliciTI_fromVM/Components/mrfi/smartrf/CC2500/10Kbd smartrf_CC2500.h
/***************************************************************
 *  SmartRF Studio(tm) Export
 *
 *  Radio register settings specifed with C-code
 *  compatible #define statements.
 *
 *  RF device: CC2500
 *
 ***************************************************************/

#ifndef SMARTRF_CC2500_H
#define SMARTRF_CC2500_H

#define SMARTRF_RADIO_CC2500
#define SMARTRF_SETTING_IOCFG2           0x29
#define SMARTRF_SETTING_IOCFG1           0x2E
#define SMARTRF_SETTING_IOCFG0           0x06
#define SMARTRF_SETTING_FIFOTHR          0x07
#define SMARTRF_SETTING_SYNC1            0xD3
#define SMARTRF_SETTING_SYNC0            0x91
#define SMARTRF_SETTING_PKTLEN           0xFF
#define SMARTRF_SETTING_PKTCTRL1         0x04
#define SMARTRF_SETTING_PKTCTRL0         0x05
#define SMARTRF_SETTING_ADDR             0x00
#define SMARTRF_SETTING_CHANNR           0x00
#define SMARTRF_SETTING_FSCTRL1          0x06
#define SMARTRF_SETTING_FSCTRL0          0x00
#define SMARTRF_SETTING_FREQ2            0x5D
#define SMARTRF_SETTING_FREQ1            0x93
#define SMARTRF_SETTING_FREQ0            0xB1
#define SMARTRF_SETTING_MDMCFG4          0x78
#define SMARTRF_SETTING_MDMCFG3          0x93
#define SMARTRF_SETTING_MDMCFG2          0x03
#define SMARTRF_SETTING_MDMCFG1          0x22
#define SMARTRF_SETTING_MDMCFG0          0xF8
#define SMARTRF_SETTING_DEVIATN          0x44
#define SMARTRF_SETTING_MCSM2            0x07
#define SMARTRF_SETTING_MCSM1            0x30
#define SMARTRF_SETTING_MCSM0            0x18
#define SMARTRF_SETTING_FOCCFG           0x16
#define SMARTRF_SETTING_BSCFG            0x6C
#define SMARTRF_SETTING_AGCCTRL2         0x43
#define SMARTRF_SETTING_AGCCTRL1         0x40
#define SMARTRF_SETTING_AGCCTRL0         0x91
#define SMARTRF_SETTING_WOREVT1          0x87
#define SMARTRF_SETTING_WOREVT0          0x6B
#define SMARTRF_SETTING_WORCTRL          0xF8
#define SMARTRF_SETTING_FREND1           0x56
#define SMARTRF_SETTING_FREND0           0x10
#define SMARTRF_SETTING_FSCAL3           0xA9
#define SMARTRF_SETTING_FSCAL2           0x0A
#define SMARTRF_SETTING_FSCAL1           0x00
#define SMARTRF_SETTING_FSCAL0           0x11
#define SMARTRF_SETTING_RCCTRL1          0x41
#define SMARTRF_SETTING_RCCTRL0          0x00
#define SMARTRF_SETTING_FSTEST           0x59
#define SMARTRF_SETTING_PTEST            0x7F
#define SMARTRF_SETTING_AGCTEST          0x3F
#define SMARTRF_SETTING_TEST2            0x88
#define SMARTRF_SETTING_TEST1            0x31
#define SMARTRF_SETTING_TEST0            0x0B
#define SMARTRF_SETTING_PARTNUM          0x80
#define SMARTRF_SETTING_VERSION          0x03
#define SMARTRF_SETTING_FREQEST          0x00
#define SMARTRF_SETTING_LQI              0x00
#define SMARTRF_SETTING_RSSI             0x00
#define SMARTRF_SETTING_MARCSTATE        0x00
#define SMARTRF_SETTING_WORTIME1         0x00
#define SMARTRF_SETTING_WORTIME0         0x00
#define SMARTRF_SETTING_PKTSTATUS        0x00
#define SMARTRF_SETTING_VCO_VC_DAC       0x00
#define SMARTRF_SETTING_TXBYTES          0x00
#define SMARTRF_SETTING_RXBYTES          0x00
#define SMARTRF_SETTING_RCCTRL1_STATUS   0x00
#define SMARTRF_SETTING_RCCTRL0_STATUS   0x00

#endif
